## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                      NAME                      |
|--------|------------------------------------------------|
| add    | `aws_security_group_rule.database_ingress_ecs` |
|        | `aws_security_group_rule.ecs_egress_all`       |
|        | `aws_security_group_rule.ecs_egress_database`  |
|        | `aws_security_group_rule.ecs_ingress_lb`       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group_rule.database_ingress_ecs will be created
  + resource "aws_security_group_rule" "database_ingress_ecs" {
      + description              = "Allow DocumentDB cluster to receive requests from ECS"
      + from_port                = 27017
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-04966047bf236b850"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-085c606383f33733e"
      + to_port                  = 27017
      + type                     = "ingress"
    }

  # aws_security_group_rule.ecs_egress_all will be created
  + resource "aws_security_group_rule" "ecs_egress_all" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow ECS security group to send all traffic"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = "sg-085c606383f33733e"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_security_group_rule.ecs_egress_database will be created
  + resource "aws_security_group_rule" "ecs_egress_database" {
      + description              = "Allow ECS to talk to the DocumentDB cluster"
      + from_port                = 27017
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-085c606383f33733e"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-04966047bf236b850"
      + to_port                  = 27017
      + type                     = "egress"
    }

  # aws_security_group_rule.ecs_ingress_lb will be created
  + resource "aws_security_group_rule" "ecs_ingress_lb" {
      + description              = "Allow the ecs security group to receive traffic only from the load balancer on port 3001"
      + from_port                = 3001
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-085c606383f33733e"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-08e35f1019824d56a"
      + to_port                  = 3001
      + type                     = "ingress"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.ai_answers_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_tasks"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_ssm_parameter.sentinel_forwarder_auth"]

26 tests, 19 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
